#include<iostream>
#include<stdlib.h>

using namespace std;

int main(void) {
	//int ages[5][25];//定义一个二维数组
	int i = 0, j = 0;
	//初始化
	//第一种方式
	/*
	int a[3][4] = {
		{1,2,3,4},
		{5,6,7,8},
		{9,10,11,12}
	};
	//第二种方式 初始化时从头开始,依次序进行
	int a1[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
	int a2[3][4] = { 1 };//只初始化第一个元素,其他默认置零
	int a3[][4] = {1,2,3};
	for (i = 0; i < 1; i++) {
		for (j = 0; j < 4; j++) {
			printf("%d ", a3[i][j]);
		}
		printf("\n");
	}
	*/
	int a[3][4]={
		{1,2,3,4},
		{5,6,7,8},
		{9,10,11,12}
	};
	//使用一个循环给二维数组赋值

	/*
	for (i = 0; i < 12; i++) {
		a[i/4][i%4]=i+1;
	}
	*/
	//使用两重循环对二维数组赋值
	
	for (i = 0; i < 3; i++) {
		for (j = 0; j < 4; j++) {
			a[i][j] = i * 4 + j + 1;
		}
	}
	
	//a[0][0] = 1; a[1][0] = 5;a[2][0] = 9;

	for (i = 0; i < 3; i++) {
		for (j = 0; j < 4; j++) {
			printf("%d ", a[i][j]);
		}
		printf("\n");
	}
	//i = 0 a[0][0]; 1 = > a[0][1]; 3 = > a[0][3];4=>a[1][0];5=>a[1][1];
	//9=>a[2][1]
	system("pause");
	return 0;
}