#include<iostream>
#include<windows.h>

using namespace std;

/*
1000块钱,要买100只鸡
公鸡每只50块
母鸡每只30块
小鸡每3只10块
问:一共有多少种买法

公鸡:1-20(1000/50)
母鸡:1-33(1000/30)
小鸡1-99

组合是否合法:
1)公鸡+母鸡+小鸡=100
2)公鸡钱+母鸡钱+小鸡钱=1000
*/
int main(void) {
	for (int i = 1; i <= 12; i++) {      //i表示公鸡数
		//当公鸡数为i时:
		for (int j = 1; j <= 18; j++) {  //j表示母鸡数
		//当母鸡数为j时:
			//for (int k = 1; k <=84; k++) {
			//	12×18×84中的循环次数
			/*if (i + j + k == 100 && k % 3 == 0 && i * 50 + j * 30 + k / 3 * 10==1000) {
				cout << "公鸡:" << i << "母鸡:" << j << "小鸡:" << k << endl;
			}*/
			int k = 100 - i - j;         //k表示小鸡数量
			if ( k % 3 == 0 && i * 50 + j * 30 + k / 3 * 10==1000) {
				cout << "公鸡:" << i << "母鸡:" << j << "小鸡:" << k << endl;
			}
		}
	}
	system("pause");
	return 0;
}